export const data = [
  {
    title: 'Кабель и провод',
  },
  {
    title: 'Светотехника',
  },
  {
    title: 'Модульное и щитовое оборудование',
  },
  {
    title: 'Метизы',
  },
  {
    title: 'Инструменты',
  },
  {
    title: 'Электробытовые товары',
  },
  {
    title: 'Теплый пол',
  },
  {
    title: 'Низковольтное оборудование',
  },
  {
    title: 'Строительные материалы',
  },
  {
    title: 'Климатическая техника',
  },
  {
    title: 'Вентиляция и люки доступа',
  },
  {
    title: 'Стабилизаторы напряжения',
  },
  {
    title: 'Генераторы',
  },
];
