export const data = [
  {
    id: 1,
    title: 'Умный дом',
  },
  {
    id: 2,
    title: 'Milwaukee',
  },
  {
    id: 3,
    title: 'Изделия для электромонтажа',
  },
  {
    id: 4,
    title: 'Розетки и выключатели',
  },
  {
    id: 5,
    title: 'Кабель и провод',
  },
  {
    id: 6,
    title: 'Светотехника',
  },
  {
    id: 7,
    title: 'Модульное и щитовое оборудование',
  },
  {
    id: 8,
    title: 'Метизы',
  },
  {
    id: 9,
    title: 'Инструменты',
  },
  {
    id: 10,
    title: 'Электробытовые товары',
  },
  {
    id: 11,
    title: 'Теплый пол',
  },
  {
    id: 12,
    title: 'Низковольтное оборудование',
  },
  {
    id: 13,
    title: 'Климатическая техника',
  },
  {
    id: 14,
    title: 'Строительные материалы',
  },
  {
    id: 15,
    title: 'Вентиляция и люки доступа',
  },
  {
    id: 16,
    title: 'Стабилизаторы напряжения',
  },
  {
    id: 17,
    title: 'Высоковольтное оборудование',
  },
  {
    id: 18,
    title: 'Генераторы',
  },
];
