export const data = [
  {
    link: '/',
    name: 'Умный дом',
  },
  {
    link: '/',
    name: 'Milwaukee',
  },
  {
    name: 'Изделия для электромонтажа',
    children: [
      {
        name: 'Трубы и держатели',
        children: [
          {
            name: 'Труба гофрированная',
            link: '/products/truba',
          },
        ],
      },
      {
        name: 'Изолента',
        link: '/',
      },
      {
        name: 'Знаки безопасности',
        link: '/',
      },
    ],
  },
  {
    link: '/',
    name: 'Розетки и выключатели',
  },
  {
    link: '/',
    name: 'Кабель и провод',
  },
  {
    link: '/',
    name: 'Светотехника',
  },
  {
    link: '/',
    name: 'Модульное и щитовое оборудование',
  },
  {
    link: '/',
    name: 'Метизы',
  },
  {
    link: '/',
    name: 'Инструменты',
  },
  {
    link: '/',
    name: 'Электробытовые товары',
  },
  {
    link: '/',
    name: 'Теплый пол',
  },
  {
    link: '/',
    name: 'Низковольтное оборудование',
  },
  {
    link: '/',
    name: 'Климатическая техника',
  },
  {
    link: '/',
    name: 'Строительные материалы',
  },
  {
    link: '/',
    name: 'Вентиляция и люки доступа',
  },
  {
    link: '/',
    name: 'Стабилизаторы напряжения',
  },
  {
    link: '/',
    name: 'Высоковольтное оборудование',
  },
  {
    link: '/',
    name: 'Генераторы',
  },
];
